tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "mas-cli/tap"
tap "microsoft/git"
brew "ack"
brew "act"
brew "awscli"
brew "bash"
brew "boost"
brew "clisp"
brew "cmake"
brew "cmatrix"
brew "cowsay"
brew "cvs"
brew "docker"
brew "docker-compose"
brew "erlang"
brew "elixir"
brew "sdl2"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "ghc"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "haskell-stack"
brew "htop"
brew "hub"
brew "id3tool"
brew "jq"
brew "lesspipe"
brew "llvm"
brew "man2html"
brew "mas"
brew "mercurial"
brew "nmap"
brew "node"
brew "poetry"
brew "python"
brew "ruby-build"
brew "rbenv"
brew "sdl2_image"
brew "sdl2_ttf"
brew "shellcheck"
brew "sl"
brew "ssh-copy-id", link: true
brew "terminal-notifier"
brew "the_silver_searcher"
brew "tox"
brew "travis"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "heroku/brew/heroku"

# mas-cli before 'cask' to give precendence to app store versions of things
mas "Moom", id: 419330170
mas "Pixelmator Pro", id: 1289583905
mas "Tailscale", id: 1475387142

cask "android-platform-tools"
cask "atom"
cask "chromium"
cask "discord"
cask "firefox"
cask "firefox-developer-edition"
cask "flux"
cask "google-chrome"
cask "irccloud"
cask "iterm2"
cask "keybase"
cask "little-snitch"
cask "minecraft"
cask "moonlight"
cask "quicknfo"
cask "signal"
cask "sketch"
cask "skype"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "suspicious-package"
cask "the-unarchiver"
cask "transmission-remote-gui"
cask "visual-studio-code"
cask "vlc"
cask "webpquicklook"
cask "zoom"

# VS Code Plugins, too
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "hashicorp.hcl"
vscode "haskell.haskell"
vscode "justusadam.language-haskell"
vscode "MaxGabriel.brittany"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.atom-keybindings"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "Shopify.ruby-lsp"
vscode "the-compiler.python-tox"

# manual install
#
# RODE Central - https://rode.com/en/apps/rode-central